OpenFOAM-6-master/tutorials/lagrangian/reactingParcelFoam/rivuletPanel/0/wallFilmRegion/Uf
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/wallFilmRegion";
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wallFilmFaces_top
    {
        type            slip;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            noSlip;
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0 -0.075 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            noSlip;
    }
}


// ************************************************************************* //
